#### AdvancedMetal Members

---

|  |
| --- |
| AdvancedMetal Class   Properties   See Also |

The  AdvancedMetal  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | MetalF0 | The property labeled "Reflectance" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceAlbedo | The property labeled "Color" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceCutout | The property labeled "Image" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceNdfType | The property labeled "NDF" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceNormal | The property labeled "Image" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceRotation | The property labeled "Rotation" from the "AdvancedMetal" schema. |
| Public property Static member | SurfaceRoughness | The property labeled "Roughness" from the "AdvancedMetal" schema. |

# See Also

AdvancedMetal Class

Autodesk.Revit.DB.Visual Namespace